REPR_VACANCY = """
Наименование вакансии: {name}
Ссылка на вакансии: {url}
Описание вакансии: {description}
Зарплата: {salary}
Город: {city}
"""

CHOOSING_SITE = """Введите 1 для поиска вакансий на сайте hh.ru 
или введите 2 для поиска вакансий на сайте superjob.ru. 
Чтобы выйти из приложения введите 0.\n"""

KEYWORD_FOR_SEARCH = """Введите ключевое слово для поиска \n"""

PRINT_VACANCIES = """
Вакансия №: {unique}
________________________________________________________________________
Наименование вакансии: {name}
Ссылка на вакансии: {url}
Описание вакансии: {description}
Зарплата: {salary}
Город: {city}
________________________________________________________________________
"""
DEL_OR_CUT_VACANCIES = """Введите 1 для удаления вакансий 
или введите 2 для вакансий, которые нужно оставить. 
Чтобы выйти из приложения введите 0.\n"""

DEL_LIST = """Введите номера вакансий через пробел для их удаления из списка\n"""

CUT_LIST = """Введите номера вакансий через пробел чтобы оставить их в списке списка\n"""

GO_ON = """Если хотите проложить введите 1. 
Чтобы выйти из приложения введите 0.\n"""

FINAL_PRINT = """Спасибо, что использовали приложение "Vacancies via API" """
